OdIfcUnitConverter.appendUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends new convertible unit.
\param unitName [in] Name of convertible unit.
\param unitId [in] Id of corresponding IfcConversionBasedUnit.

OdIfcUnitConverter.convertToSIUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Performs an attempt to convert specified unit to the SI unit.
\param unitName [in] Name of unit to be converted.
\param val [in] Unit value.
\returns Returns a result of conversion.

OdIfcUnitConverter.#ctor(OdIfcFile*)
\details
Creates a new IFC converter object.
\param pFile [in] A raw pointer to an IfcFile object.